# Maxwell's macOS toolchain — install with: brew bundle --file=Brewfile
# Regenerate with: brew bundle dump --force --file=Brewfile

# ----- Taps -----
tap "polymarket/polymarket-cli", "https://github.com/Polymarket/polymarket-cli"
tap "stripe/stripe-cli"
tap "supabase/tap"

# ----- Core CLI -----
brew "coreutils"
brew "git"
brew "gh"
brew "pandoc"
brew "ffmpeg"

# ----- Modern CLI replacements -----
brew "starship"        # prompt
brew "zoxide"          # smart cd
brew "fzf"             # fuzzy finder
brew "eza"             # ls
brew "bat"             # cat
brew "ripgrep"         # grep
brew "fd"              # find

# ----- Zsh plugins (used by zinit, but installed via brew as backup) -----
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ----- Languages / runtimes -----
brew "node", link: false
brew "node@22", link: true
brew "python@3.12"
brew "python@3.13"
brew "openjdk"
brew "uv"              # python package manager
brew "swiftformat"

# ----- Cloud / SaaS CLIs -----
brew "firebase-cli"
brew "flyctl"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "polymarket/polymarket-cli/polymarket"

# ----- Roblox dev -----
brew "aftman"
brew "rojo"

# ----- iOS / Xcode -----
brew "xcodegen"

# ----- Casks -----
cask "ghostty"                          # terminal
cask "font-jetbrains-mono-nerd-font"    # nerd font for starship glyphs
cask "android-platform-tools"
cask "android-studio"
cask "godot"
cask "localsend"
cask "ngrok"

# ----- VSCode extensions -----
vscode "anthropic.claude-code"
vscode "github.copilot-chat"
vscode "kamikillerto.vscode-colorize"
vscode "yzhang.markdown-all-in-one"
